const LANG = {
    cmd: {
        warn: "Не копіюйте або редагуйте нічого в DevTools, якщо ця дія не одобрена розробником.",
        eval: "Це версія для попередньої оцінки, ця версія призначена для тестування та виправлення функцій та помилок перед випуском.",
        dev: "Це версія для розробки, все, що ви роботите тут не пов'язано з версією попередньої оцінки або випуском.",
        erorrs: {
            NOLINK: "Не має присвоєнного посилання"
        }
    },
    BUILD: {
        dev: "ВЕРСІЯ ДЛЯ РОЗРОБКИ",
        eval: "ВЕРСІЯ ДЛЯ ПОПЕРЕДНЬОЇ ОЦІНКИ",
        sdb: "ВИДІЛЕНА НЕЗАЛЕЖНА БАЗА ДАНИХ"
    },
    TOS: [
        {
            label: "Умови надання послуг Furry Index",
            text: "Останнє оновлення: 23.08.2025"
        },
        {
            label: "Загальні положення",
            text: [
                "Ці Умови надання послуг (далі — «Умови») регулюють порядок доступу та використання вами (далі — «Користувач») сервісу Furry Index (далі — «Сервіс»).",
                "Використовуючи Сервіс, ви погоджуєтеся дотримуватися цих Умов та правил, викладених у них.",
                "Якщо ви не погоджуєтеся з Умовами, будь ласка, не використовуйте Сервіс.",
                "Деякі правила підпадають під «правило трьох попереджень». Порушення може призвести до одного попередження (Strike). Після отримання третього попередження Користувач буде назавжди заблокований у Сервісі."
            ]
        },
        {
            label: "Політика даних та cookie",
            text: [
                "Сервіс використовує cookie лише для необхідного функціоналу.",
                "Сервіс збирає лише дані, які Користувач надає явно. Єдина за винятком — дані, пов'язані з сесією.",
                "Усі дані Користувача захищені заходами конфіденційності, за винятком даних, які є загальнодоступними або явно передані за згодою Користувача.",
                "Дані Користувача є частиною Сервісу і не будуть передаватися третім особам."
            ]
        },
        {
            label: "Обліковий запис",
            text: [
                "Деякі функції Сервісу вимагають реєстрації облікового запису.",
                "Реєструючись, Користувач підтверджує, що йому/їй виповнилося щонайменше 18 років. Облікові записи, у яких встановлено неправдивий вік, будуть призупинені до досягнення Користувачем 18 років.",
                "Користувачі молодші за 18 років можуть користуватися Сервісом лише за умови вимкнення контенту для дорослих (NSFW) у налаштуваннях.",
                "Користувач несе повну відповідальність за безпеку свого профілю та пароля.",
                "Будь-які дії, спрямовані на порушення стабільної роботи Сервісу, призведуть до видалення облікового запису.",
                "Закриття облікового запису можливе в будь-який час, за винятком випадків, коли Користувач завантажив контент до Сервісу. У таких випадках припинення акаунта має бути узгоджене з Адміністрацією Сервісу."
            ]
        },
        {
            label: "Контент",
            text: [
                "Користувачі можуть публікувати контент за умови його відповідності Правилам публікації.",
                "Користувачі зберігають авторські права на свій контент, але надають Сервісу невиключну, всесвітню ліцензію на відображення цього контенту та внесення технічних змін*, необхідних для належної роботи.",
                "Заборонено використовувати контент, розміщений у Сервісі, для навчання систем штучного інтелекту.",
                "Завантажений контент має бути або оригінальним, або вільнодоступним. Контент із платних джерел, поширений без дозволу, буде видалено.",
                "Увесь контент має бути належно позначений як NSFW або безпечний (Safe), залежно від його характеру.",
                "Контент, що порушує авторські права, є незаконним, спамом, шкідливим або графічно тривожним, буде видалено."
            ]
        },
        {
            label: "Загальні обмеження Сервісу",
            text: [
                "Використання Сервісу в незаконних цілях категорично заборонено.",
                "Адміністрація Сервісу зобов'язана застосовувати ці Умови та вживати заходів проти Користувачів, які їх порушують.",
                "Адміністративні рішення є остаточними та не підлягають обговоренню. У виняткових випадках Користувачі можуть подати апеляцію."
            ]
        },
        {
            label: "Загальна відмова від відповідальності",
            text: [
                "Сервіс надається «як є» без будь-яких гарантій.",
                "Адміністрація не несе відповідальності за відмови, перебої або втрату даних.",
                "Адміністрація не несе відповідальності за контент, створений або опублікований Користувачами; відповідальність лежить на Користувачеві, який його опублікував."
            ]
        },
        {
            label: "Оновлення Умов",
            text: [
                "Ці Умови можуть періодично оновлюватися.",
                "Після оновлення Користувачі будуть повідомлені про зміни.",
                "Продовжуючи користуватися Сервісом після таких оновлень, Користувач погоджується з переглянутою версією Умов."
            ]
        },
        {
            label: "Особливі зауваження",
            text: [
                "* — Під «зміною користувацького контенту» ми маємо на увазі технічні коригування, такі як зміна розміру зображень для оптимізації відображення або перекодування GIF у MP4 для підвищення продуктивності."
            ]
        }
    ],
    PP: [
        {
            label: "Політика конфіденційності Furry Index",
            text: [
                "Останнє оновлення: 23.08.2025",
                "Furry Index (\"ми\", \"наш\" або \"нас\") цінує вашу приватність. Ця Політика конфіденційності пояснює, як ми збираємо, використовуємо та захищаємо вашу персональну інформацію під час використання Сервісу (далі — «Сервіс»)."
            ]
        },
        {
            label: "Інформація, яку ми збираємо",
            text: [
                "Інформація облікового запису, яку ви надаєте під час реєстрації та заповнення профілю.",
                "Дані сесії, такі як операційна система та тип браузера.",
                "Контент, який ви завантажуєте до Сервісу.",
                "Внутрішня статистика щодо ваших дій у Сервісі."
            ]
        },
        {
            label: "Як ми використовуємо вашу інформацію",
            text: [
                "Надання, підтримка та вдосконалення Сервісу.",
                "Внутрішня аналітика Сервісу (ви можете відмовитися від включення своїх даних до агрегованої аналітики).",
                "Забезпечення безпеки та цілісності Сервісу.",
                "Зв'язок із вами щодо Сервісу.",
                "Виконання юридичних зобов'язань."
            ]
        },
        {
            label: "Як ми передаємо вашу інформацію",
            text: [
                "Уся інформація залишається власністю Користувача та Сервісу і ніколи не продається.",
                "Дані можуть бути передані правоохоронним органам, якщо цього вимагає закон або юридична процедура.",
                "Чутлива інформація Користувача не розкривається за жодних обставин, за винятком випадків, коли це вимагається законом."
            ]
        },
        {
            label: "Cookies та відстеження",
            text: [
                "Cookie використовуються для керування сесіями та автентифікації Користувачів у Сервісі.",
                "WebSocket можуть використовуватися для відстеження поточної сторінки Користувача з метою надсилання дій або оновлень у реальному часі, що стосуються цієї сесії.",
                "Якщо ви блокуєте cookie, ви не зможете увійти до Сервісу."
            ]
        },
        {
            label: "Безпека даних",
            text: [
                "Ми використовуємо розумні технічні та організаційні заходи для захисту вашої інформації від несанкціонованого доступу, втрати, зловживань або розголошення.",
                "Однак жоден метод передачі чи зберігання даних в інтернеті не може бути гарантовано на 100% безпечним."
            ]
        },
        {
            label: "Ваші права",
            text: [
                "Запитувати доступ до ваших персональних даних, їх оновлення або видалення, що зберігаються Сервісом.",
                "Відмовитися від певних видів обробки даних, де це передбачено законом.",
                "Запитати копію ваших персональних даних, зібраних Сервісом."
            ]
        },
        {
            label: "Контент та персональні дані",
            text: [
                "Контент, створений користувачами (наприклад, художні роботи, пости та файли), який завантажується до Сервісу, не вважається персональними даними за цією Політикою конфіденційності.",
                "Такий контент регулюється Умовами надання послуг, включаючи правила щодо власності, авторських прав і обмежень використання.",
                "Персональні дані (наприклад, електронні адреси, імена користувачів або інша ідентифікаційна інформація) зберігаються окремо та захищені відповідно до цієї Політики конфіденційності."
            ]
        },
        {
            label: "Конфіденційність неповнолітніх",
            text: [
                "Сервіс не призначений для користувачів віком до 18 років.",
                "Хоча ми не можемо повністю запобігти доступу неповнолітніх до Сервісу, ми просимо користувачів дотримуватися Умов надання послуг та користуватися Сервісом відповідально й відповідно до віку."
            ]
        },
        {
            label: "Оновлення Політики конфіденційності",
            text: [
                "Ця Політика конфіденційності може періодично оновлюватися.",
                "Коли відбуваються оновлення, Користувачі будуть повідомлені через Сервіс.",
                "Продовжуючи користуватися Сервісом після таких оновлень, ви погоджуєтеся з переглянутою версією Політики конфіденційності."
            ]
        }
    ],
    header: {
        main: "Головна",
        search: "Пошук",
        settings: "Налаштунки",
        upload: "Завантажити",
        fileManager: "Менеджер файлів",
        postMaster: "PostMaster",
        userCard: {
            login: "Увійти",
            register: "Реєстрація"
        }
    },
    login: {
        mainLabel: "Вхід",
        button: "Увійти",
        fields: {
            username: "Ім'я користувача",
            password: "Пароль",
            keepmeloggedin: "Запам'ятати мене"
        },
        errors: {
            wrongUsername: "Невірне ім'я користувача",
            wrondPassword: "Невірний пароль"
        },
        success: [
            "Ви увійшли як",
            "Успіх"
        ]
    },
    register: {
        label: "Реєстрація",
        username: {
            label: "Ім'я користувача",
            error: {
                min: "Мінімум",
                max: "Максимум",
                chars: "символів",
                lowecase: "Тільки малі літери",
                restrictedSymbol: "Заборонений символ",
                taken: {
                    default: "Ім'я повинно бути унікальним",
                    ok: "Ім'я унікальне",
                    nok: "Ім'я заняте"
                },
                specialSymbolCheck: {
                    default: "Спец. символи заборонені",
                    ok: "Спец. символи не знайдені",
                    nok: "Приберіть спец. символи"
                }
            }
        },
        passFirst: {
            label: "Пароль",
            error: {
                min: "Мінімум",
                max: "Максимум",
                chars: "символів",
                uppercase: "Потрібен великий символ",
                numbers: "Потрібна цифра"
            }
        },
        passSecond: {
            label: "Повторіть пароль",
            error: {
                notMatch: "Паролі повинні співпадати"
            }
        },
        TOS: "Умови надання послуг",
        PP: "Політика конфіденційності",
        termsacc: {
            label: "Ви згідні з цими умовами?",
            no: "Ні",
            yes: "Так"
        },
        rememberMe: {
            label: "Запам'ятати мене"
        },
        autologin: {
            label: "Автоматичний вхід"
        },
        error: {
            fixForm: "Виправте помилки у формі реєстрації",
            title: "Помилка реєстрації",
            message: "Виправте помилки у формі реєстрації і спробуйте знову."
        },
        success: [
            "Профіль зарєстровано",
            "Успіх"
        ]
    },
    fileManager: {
        noFilesLabel: "Ви не завантажили жодних файлів"
    },
    main: {
        welcome: "Вітаємо у",
        latest: "Останні пости"
    },
    postView: {
        hiddenLabel: "Цей пост не відображається",
        errors: {
            noAccess: "у вас немає доступу до цього посту",
            default: "Помилка завантаження данних посту"
        },
        file: {
            size: "Розмір",
            type: "Тип файлу",
            uploadedBy: "Завантажений",
            linkedToPost: "Пост",
            resolution: "Розширення",
            uploadedOn: "Завантажено"
        },
        rating: "Рейтинг",
        favourite: "Обране"
    },
    profile: {
        noUsername: "Ім'я користувача не вказане в адресі сторінки",
        noProfile: "Профіль не знайдено",
        regsitered: "Зареєстрований",
        latestPosts: "Останні пости"
    },
    upload: {
        groupUpload: "Завантажити усе"
    },
    postMaster: {
        newPost: "Створити"
    },
    settings: {
        label: "Налаштунки",
        typeSwitch: {
            webpage: "Сторінка",
            user: "Користувач",
            placeholder: "Оберіть тип"
        },
        webpage: {
            language: {
                label: "Мова",
                ENG: "Англійська",
                UA: "Українська",
                RU: "російська"
            },
            postsPerPage: "Пости на сторінку"
        },
        user: {
            logout: "Вийти з",
            selectAvatar: "Обрати аватар",
            selectBtn: "Обрати",
            removeAvatar: "Прибрати аватар",
            removeAvatarAlert: "Ви впевнені, що хочете видалити аватар?",
            noAvatarFiles: "Файлів для аватару не знайдено",
            uploadFile: "Завантажити новий файл",
            loggedOut: [
                "Ви вийшли з",
                "успішно"
            ],
            visibleName: {
                label: "Відображуване ім'я",
                setBtn: "Задати",
                rmBtn: "Прибрати",
                result: {
                    setsucc: "Успішно задано відображуване ім'я",
                    rmsucc: "Відображуване ім'я прибрано"
                }
            },
            filesPerPage: "Файли на сторінку"
        }
    },
    components: {
        upload: {
            field: "Натисніть або перетягніть файли",
            errors: {
                file: "Файл",
                unsupportedType: "має непідтримуваний тип",
                tooLarge: "завеликий",
                maxSize: "Максимальний розмір"
            }
        }
    },
    elements: {
        fileCard: {
            fnameNotBeSaved: "Ім'я файлу не буде збережене на сервері",
            fsize: "Розмір",
            ftype: "Тип",
            segment: [
                "Сегмент",
                "Вага"
            ],
            linked: {
                label: "Пов'язан з",
                to: {
                    post: "постом",
                    pfavatar: "аватаром"
                }
            },
            delete: {
                buttonLabel: "Видалити",
                confirm: "Перевірка",
                confirmText: [
                    "Ви хочете видалити файл",
                    "?"
                ],
                alert: "Видалено файл"
            },
            useAsAvatar: "Аватар",
            uploadBtn: "Завантажити"
        },
        postCard: {
            rating: {
                safe: "Безпечно",
                questionable: "Під питанням",
                mature: "Для дорослих"
            },
            type: {
                image: "Зображення",
                imageGroup: "Группа зображень",
                comic: "Комікс",
                video: "Відео"
            },
            editButtons: {
                visible: "Видимість",
                remove: "Видалити",
                edit: "Редагувати",
                successRM: [
                    "Пост",
                    "прибрано"
                ]
            },
            score: "Рейтинг",
            favs: "У обраному"
        },
        postMaker: {
            postName: "Назва",
            postDesc: "Опис",
            postType: "Тип",
            postRating: "Рейтинг",
            filesList: "Список файлів",
            noFiles: "Файли не обрано",
            tags: "Теги",
            createPost: "Створити",
            editPost: "Редагувати",
            include: "Вкласти",
            successCreate: [
                "Пост",
                "успішно створено"
            ],
            successEdit: [
                "Пост",
                "успішно відредаговано"
            ]
        },
        messages: {
            noMsg: "Немає повідомлень... поки що",
            message: "Повідомлення...",
            send: "Відправити",
            messageElem: {
                editedAt: "Повідомлення відредаговано",
                editMessage: "Редагувати повідомлення",
                removeMessage: "Видалити повідомлення"
            }
        },
        search: {
            label: "Пошук"
        },
        dropdown: {
            label: "Обрати"
        },
        image: {
            ageRestriction: {
                label: "Вам є 18?",
                no: "Ні",
                yes: "Так"
            }
        }
    },
    features: {
        alert: {
            confirm: {
                confirmButton: "Так",
                cancelButton: "Ні"
            }
        },
        favs: {
            limit: {
                top: "Увага!",
                content: "Ви зберегли 50 обраних в офлайн режимі.\n\nЗареєструйтесь щоб додавати в обрані без обмежень."
            }
        }
    }
};

export default LANG
